local SQMJConf =
{
    intGameId = "SQMJ",
    intGamePlayer = 4,
    -- tFastInfo = {
    --     "快点啊，都等的我花儿都谢了！",
    --     "别吵了，专心玩游戏！",
    --     "你是妹妹还是哥哥啊？",
    --     "大家好,很高兴见到各位！",
    --     "又断线了，网络怎么这么差！",
    --     "和你合作真是太愉快了",
    --     "下次再玩吧，我要走了。",
    --     "不要走，决战到天亮。",
    --     "我们交个朋友吧，告诉我你的联系方法。",
    --     "各位，真不好意思，我要离开会。", 
    -- },
    tGamesRule = {
        pay = {
            "玩家平摊",
            "房主出资",
            "大赢家出资",
        },
        -- 圈数信息
        round = {
            {
                "4局",
                20,
                5,
                -- 4,
            },
            {
                "8局",
                40,
                10,
                -- 8,
            },
        },   
        -- 底分
        baseScore = {1,2,5,10,20},
        --胡牌信息
        playRule = { 
            {"可胡七对",0},    
        },
        tStartRule = {0,0,1,0,0,0,0,0,0,1},
     },
}


return SQMJConf
